================================================================================
Triple-quoted multi-line string
================================================================================

description: """
This is a longer description
that spans multiple lines.
"""

--------------------------------------------------------------------------------

(source_file
  (variable
    name: (ident)
    value: (value
      (atom
        (string)))))

================================================================================
String with escape sequences
================================================================================

synopsis: "Line 1\nLine 2\tTabbed"

--------------------------------------------------------------------------------

(source_file
  (variable
    name: (ident)
    value: (value
      (atom
        (string
          (escape_sequence)
          (escape_sequence))))))

================================================================================
String with quotes
================================================================================

description: "This has \"quoted\" text"

--------------------------------------------------------------------------------

(source_file
  (variable
    name: (ident)
    value: (value
      (atom
        (string
          (escape_sequence)
          (escape_sequence))))))

================================================================================
Identifiers with special characters
================================================================================

depends: [
  "base-unix"
  "ocaml-base-compiler"
  "conf-libev"
]

--------------------------------------------------------------------------------

(source_file
  (variable
    name: (ident)
    value: (value
      (list
        values: (value
          (atom
            (string)))
        values: (value
          (atom
            (string)))
        values: (value
          (atom
            (string)))))))

================================================================================
Version with tilde
================================================================================

version: "6.0.0~alpha00"

--------------------------------------------------------------------------------

(source_file
  (variable
    name: (ident)
    value: (value
      (atom
        (string)))))

================================================================================
Version with plus
================================================================================

depends: [
  "ocaml-variants" {= "5.1.0~alpha1+options"}
]

--------------------------------------------------------------------------------

(source_file
  (variable
    name: (ident)
    value: (value
      (list
        values: (value
          (option_value
            value: (value
              (atom
                (string)))
            options: (value
              (prefix_relop
                operator: (relop)
                value: (atom
                  (string))))))))))

================================================================================
Boolean values
================================================================================

build-test: true
build-doc: false

--------------------------------------------------------------------------------

(source_file
  (variable
    name: (ident)
    value: (value
      (atom
        (bool))))
  (variable
    name: (ident)
    value: (value
      (atom
        (bool)))))

================================================================================
Integer values
================================================================================

priority: 100
some-count: -42

--------------------------------------------------------------------------------

(source_file
  (variable
    name: (ident)
    value: (value
      (atom
        (int))))
  (variable
    name: (ident)
    value: (value
      (atom
        (int)))))

================================================================================
Empty list
================================================================================

patches: []

--------------------------------------------------------------------------------

(source_file
  (variable
    name: (ident)
    value: (value
      (list))))

================================================================================
Empty group
================================================================================

extra: ()

--------------------------------------------------------------------------------

(source_file
  (variable
    name: (ident)
    value: (value
      (group))))

================================================================================
Colon in identifier
================================================================================

post-messages: [
  "Note: This package is experimental"
]

--------------------------------------------------------------------------------

(source_file
  (variable
    name: (ident)
    value: (value
      (list
        values: (value
          (atom
            (string)))))))

================================================================================
Underscores in identifier
================================================================================

dev_repo: "git+https://github.com/user/repo.git"

--------------------------------------------------------------------------------

(source_file
  (variable
    name: (ident)
    value: (value
      (atom
        (string)))))
